// *****************************************Задание 1*****************************

// Напишите функцию, которая будет находить сумму квадратов элементов массива.


// ***************************************** Решение *****************************


// function sum(arr = []) {

//     let result = 0

//     for (let i = 0; i < arr.length; i++) {
//         result = result + arr[i]**2
//     }

//     return result
// }

// console.log(sum([2, 2, 2, 4]));


// *****************************************Задание 2*****************************

// Сделайте функцию `getDigitsSum`, которая параметром будет принимать целое 
// число и возвращать сумму его цифр.

// ***************************************** Решение *****************************


// function getDigitsSum(num) {
//     let sum = 0
//     num = num + ""
//     let arr = num.split('')
//     arr = arr.map(Number)

//     for (let i = 0; i < arr.length; i++) {
//         sum = sum + arr[i]       
//     }    
//     return (sum);    
// }
// console.log(getDigitsSum(535));


// *****************************************Задание 3*****************************

// Реализуйте функцию `getDivisors`, которая параметром будет принимать число и 
// возвращать массив его делителей, то есть чисел, на которое 
// делится наше число. К примеру, если мы передадим число `24` - 
// мы должны получить следующий массив:

// ```jsx
// [1, 2, 3, 4, 6, 8, 12, 24]
// ```

// ***************************************** Решение *****************************


// function getDivisors(num) {
//     let possibleDiv = []
//     let b = 0
//     for (let i = 1; i <= num; i++) {
//         if (num % i === 0) {                      
//            possibleDiv[b] = i
//            b++
//         }
//     }    
//     return possibleDiv
//     // console.log(possibleDiv);
// }
// console.log(getDivisors(24));


// *****************************************Задание 4*****************************

// Сделайте функцию `reverseStr`, которая параметром будет принимать строку и переворачивать 
// ее символы в обратном порядке. Решите задачу без цикла, используя комбинацию стандартных
//  функций JavaScript.

// ***************************************** Решение *****************************

// function reverseStr(num) {
//     num = num + ""
//     let arr 
//     arr = num.split('')    
//     arr.reverse()     
//     arr = arr.map(Number)    
//     return (finalArr= +arr.join(''))    
// }
// console.log(reverseStr(32155667788));


// *****************************************Задание 5*****************************

// Сделайте функцию `delElem`, которая параметрами будет принимать значение 
// в массив и удалять из массива все элементы с таким значением.

// ***************************************** Решение *****************************

// arr = [1, 2, 3, 4, 5, 4, 3, 2, 1]

// function deleElem(par) {
    
//     arr = arr.filter((el) => el !== par)
//     return arr
// } 
// console.log(deleElem(4));


// *****************************************Задание 6*****************************


// Сделайте функцию, заполняющую массив целыми числами от `1` до заданного. 
// Пример работы такой функции:

// ```jsx
// console.log(func(5)); // выведет [1, 2, 3, 4, 5]
// ```

// ***************************************** Решение *****************************




function func(num) {
    let arr = []
    let b = 0
    for (let i = 1; i <= num; i++) {
        arr[b] = i
        b++
    }
    return arr
}
console.log(func(22));